<template>
  <div id="app">
    <!-- 准备一个容器用来存放音乐播放器 -->
    <div id="player"></div>
  </div>
</template>

<script itemscope>
import APlayer from 'aplayer';
import 'aplayer/dist/APlayer.min.css';
export default {
  name: "App",
  data() {
    return {
      audio: [ // 歌曲列表
        {
          name: "起风了", // 歌曲名字
          artist: "林俊杰", // 歌曲演唱者
          url: require("../../assets/music/lin.mp3"),
          cover: require("../../assets/img/3D/OIP-C (6).png"), // 歌曲头像
          lrc:'﻿[00:09.25]起风了\n' +
              '[00:13.71]日期：2022-05-09\n' +
              '[00:26.43]起风了 - 林俊杰\n' +
              '[00:31.87]这一路上走走停停\n' +
              '[00:35.01]顺着少年漂流的痕迹\n' +
              '[00:38.15]迈出车站的前一刻\n' +
              '[00:41.41]竟有些犹豫\n' +
              '[00:44.78]不禁笑这近乡情怯\n' +
              '[00:47.93]仍无法避免\n' +
              '[00:50.37]而长野的天\n' +
              '[00:52.02]依旧那么暖\n' +
              '[00:53.50]风吹起了从前\n' +
              '[00:56.14]从前初识这世间\n' +
              '[00:58.99]万般流连\n' +
              '[01:00.84]看着天边似在眼前\n' +
              '[01:03.98]也甘愿赴汤蹈火去走它一遍\n' +
              '[01:09.10]如今走过这世间\n' +
              '[01:11.89]万般流连\n' +
              '[01:13.89]翻过岁月不同侧脸\n' +
              '[01:16.98]措不及防闯入你的笑颜\n' +
              '[01:25.99]我曾难自拔于世界之大\n' +
              '[01:30.09]也沉溺于其中梦话\n' +
              '[01:33.29]不得真假 不做挣扎 不惧笑话\n' +
              '[01:38.87]我曾将青春翻涌成她\n' +
              '[01:42.60]也曾指尖弹出盛夏\n' +
              '[01:45.85]心之所动 且就随缘去吧\n' +
              '[01:52.03]逆着光行走 任风吹雨打\n' +
              '[02:02.76]短短的路走走停停\n' +
              '[02:05.80]也有了几分的距离\n' +
              '[02:08.95]不知抚摸的是故事 还是段心情\n' +
              '[02:15.56]也许期待的不过是 与时间为敌\n' +
              '[02:20.93]再次见到你\n' +
              '[02:22.71]微凉晨光里\n' +
              '[02:24.30]笑得很甜蜜\n' +
              '[02:49.25]从前初识这世间\n' +
              '[02:55.91]万般流连\n' +
              '[02:57.66]看着天边似在眼前\n' +
              '[03:00.76]也甘愿赴汤蹈火去走它一遍\n' +
              '[03:05.68]如今走过这世间\n' +
              '[03:08.73]万般流连\n' +
              '[03:10.61]翻过岁月不同侧脸\n' +
              '[03:13.81]措不及防闯入你的笑颜\n' +
              '[03:22.85]我曾难自拔于世界之大\n' +
              '[03:26.85]也沉溺于其中梦话\n' +
              '[03:30.14]不做真假 不做挣扎 不惧笑话\n' +
              '[03:35.85]我曾将青春翻涌成她\n' +
              '[03:39.34]也曾指尖弹出盛夏\n' +
              '[03:42.77]心之所动 且就随缘去吧\n' +
              '[03:48.79]晚风吹起你鬓间的白发\n' +
              '[03:52.70]抚平回忆留下的疤\n' +
              '[03:55.87]你的眼中 明暗交杂 一笑生花\n' +
              '[04:01.55]暮色遮住你蹒跚的步伐\n' +
              '[04:05.58]走进床头藏起的画\n' +
              '[04:08.84]画中的你 低着头说话\n' +
              '[04:14.68]我仍感叹于世界之大\n' +
              '[04:17.98]也沉醉于儿时情话\n' +
              '[04:21.32]不剩真假 不做挣扎 无谓笑话\n' +
              '[04:27.30]我终将青春还给了她\n' +
              '[04:31.19]连同指尖弹出的盛夏\n' +
              '[04:34.79]心之所动 就随风去了\n' +
              '[04:40.92]以爱之名 你还愿意吗\n', // 歌词
          theme: "#fff", // 播放这首歌曲时的主题色

        },
        {
          name: "听",
          artist: "张杰",
          url: require("../../assets/music/lintening.mp3"),
          cover:require("../../assets/img/3D/jie.jpg"),
          lrc:"\n" +
              "[00:02.76]听\n" +
              "[00:07.65]作词：冀楚忱\n" +
              "[00:09.34]作曲：谭旋\n" +
              "[00:11.11]演唱：张杰\n" +
              "[00:13.89]\n" +
              "[00:48.16]谁把红尘一砖一瓦砌成墙\n" +
              "[00:55.71]让两岸桃花盛开到心慌\n" +
              "[01:02.46]二个世界\n" +
              "[01:04.23]望一轮月光\n" +
              "[01:09.24]我用手指无穷尽的探访\n" +
              "[01:14.58]\n" +
              "[01:16.73]谁把红豆一丝一缕磨成香\n" +
              "[01:24.58]让相思从缝隙里溢成江\n" +
              "[01:31.35]惊鸿入耳\n" +
              "[01:34.77]温柔了沧桑\n" +
              "[01:38.10]愿喧嚣尘世把我们遗忘\n" +
              "[01:43.66]\n" +
              "[01:45.59]听你呼吸里的伤\n" +
              "[01:49.02]听你心跳里的狂\n" +
              "[01:52.65]听你怀抱的暖蔓延过山岗\n" +
              "[01:59.74]听你眼睛里的光\n" +
              "[02:03.54]听爱在耳畔发烫\n" +
              "[02:07.12]听我们在心墙的两边刻满\n" +
              "[02:14.12]地老天荒\n" +
              "[02:38.41]\n" +
              "[02:58.71]谁把红豆一丝一缕磨成香\n" +
              "[03:06.50]让相思从缝隙里溢成江\n" +
              "[03:12.13]惊鸿入耳\n" +
              "[03:16.42]温柔了沧桑\n" +
              "[03:19.59]愿喧嚣尘世把我们遗忘\n" +
              "[03:25.69]\n" +
              "[03:27.23]听你呼吸里的伤\n" +
              "[03:30.82]听你心跳里的狂\n" +
              "[03:34.34]听你怀抱的暖蔓延过山岗\n" +
              "[03:41.50]听你眼睛里的光\n" +
              "[03:45.20]听爱在耳畔发烫\n" +
              "[03:48.93]听我们在心墙的两边地老天荒\n" +
              "[03:55.81]\n" +
              "[03:56.61]听你呼吸里的伤\n" +
              "[03:59.75]听你心跳里的狂\n" +
              "[04:03.44]听你怀抱的暖蔓延过山岗\n" +
              "[04:10.66]听你眼睛里的光\n" +
              "[04:14.31]听爱在耳畔发烫\n" +
              "[04:18.19]听我们在心墙的两边刻满\n" +
              "[04:25.16]地老天荒\n" +
              "[04:59.19]\n",
          theme: "rgb(61, 162, 230)",
        },
        {
          name: "哪里都是你",
          artist: "队长",
          url:require("../../assets/music/where.mp3"),
          cover: require("../../assets/img/3D/you.jpg"),
          lrc:"[ti:]\n" +
              "[ar:]\n" +
              "[al:]\n" +
              "[by:QQ音乐动态歌词]\n" +
              "[offset:0]\n" +
              "[00:00.00]作词 : 队长\n" +
              "[00:05.01]作曲 : 队长\n" +
              "[00:10.02]伴奏：Dear Cloud\n" +
              "[00:15.03]从不在意别人口中的自己\n" +
              "[00:21.33]她说过了一个想听花言巧语的年纪\n" +
              "[00:29.55]你选择了他们口中所谓的放弃\n" +
              "[00:34.98]却才发现早就丢掉了自己\n" +
              "[00:44.13]特别是一个人的夜里\n" +
              "[00:47.79]没人能够控制住自己\n" +
              "[00:50.79]让全部回忆藏在心底泛起涟漪\n" +
              "[00:58.89]你想要的是现在\n" +
              "[01:02.61]而不是那遥远的未来\n" +
              "[01:06.27]选择的困惑\n" +
              "[01:12.51]再没人能懂你\n" +
              "[01:14.52]生气的原因和哭泣的无力\n" +
              "[01:19.77]最遥远的距离\n" +
              "[01:27.18]忘了吧忘了吧忘了吧忘了你的所有\n" +
              "[01:31.29]不过只是找了一堆美丽的理由\n" +
              "[01:35.55]把你的痕迹都统统掩埋\n" +
              "[01:38.07]你走过的地方只剩下思念难捱\n" +
              "[01:41.91]把你藏在心头\n" +
              "[01:45.24]每天每夜想你\n" +
              "[01:48.96]害怕你的眼泪\n" +
              "[01:52.56]没人为你抹去\n" +
              "[01:55.98]不能想象没有了你的未来\n" +
              "[01:59.85]你身边那位能让你过得比我更精彩I want you back\n" +
              "[02:10.86]我忘掉你的所有风里雨里一直大步往前走\n" +
              "[02:18.03]我又怎么能够忘掉你的温柔\n" +
              "[02:25.26]换不同的场景\n" +
              "[02:28.92]但哪里都是你\n" +
              "[02:32.49]要怎么能忘记忘记你\n" +
              "[02:38.07]所有人都知道I can't let you go\n" +
              "[02:40.56]每个人都知道I can't let you go\n" +
              "[02:44.16]你为什么还不知道I can't let you go\n" +
              "[02:47.82]Baby baby I can't let you go\n" +
              "[02:51.39]在你的心里我是怎样一个人\n" +
              "[02:55.08]把话都袒露让你知道我心声\n" +
              "[02:58.77]You know you know\n" +
              "[03:02.70]感谢你陪我走过这一程\n" +
              "[03:13.26]You know you know\n" +
              "[03:15.90]感谢你陪我走过这一程\n" +
              "[03:19.41]You know you know\n" +
              "[03:22.53]每天多爱自己一点把恨我当成动力\n" +
              "[03:26.19]别那么晚睡\n" +
              "[03:29.43]我想你过的好是唯一对你放不下的\n" +
              "[03:34.20]习惯吧\n" +
              "[03:42.00]",
          theme: "#baf",
        },
      ],
      info: {
        fixed: true, // 不开启吸底模式
        listFolded: true, // 折叠歌曲列表
        autoplay: false, // 开启自动播放
        preload: "auto", // 自动预加载歌曲
        loop: "all", // 播放循环模式、all全部循环 one单曲循环 none只播放一次
        order: "list", //  播放模式，list列表播放, random随机播放
        listMaxHeight: 90,
        lrcType: 2,
      },
    };
  },
  methods: {
    initAudio() {
      // 创建一个音乐播放器实例，并挂载到DOM上，同时进行相关配置
      const ap = new APlayer({
        container: document.getElementById("player"),
        audio: this.audio, // 音乐信息
        ...this.info, // 其他配置信息
      });
    },
  },
  mounted() {
    // 初始化播放器
    this.initAudio();
  }

}
</script>

<style lang="less" scoped>
#app {

  z-index: 9999;


  #player {
    width: 310px;
    // 定个宽度
  }
}
</style>
